pikpik/minix-pkgsrc/pkgtools/pkgcvsupdate/files/pkgcvsupdate.1
.\"	$NetBSD$
.\"
.\" Copyright (c) 2001 Stoned Elipot. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Stoned Elipot
.\"	for the NetBSD Project
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 19, 2001
.Dt PKGCVSUPDATE 1
.Os
.Sh NAME
.Nm pkgcvsupdate
.Nd run CVS to update package sources in pkgsrc
.Sh SYNOPSIS
.Nm
.Ar arguments
.Sh DESCRIPTION
The
.Nm
utility should be run from a package's main directory or a package category
directory. It first updates the pkgsrc infrastructure in
.Pa ${PKGSRCDIR}/mk ,
then the package's files and recursively all the packages' files it
depend on.
.Pp
Any arguments of
.Nm
are passed down to the CVS's update command.
.Sh SEE ALSO
.Xr cvs 1 ,
.Pa ${PKGSRCDIR}/Packages.txt
and
.Rs
.%T "Documentation on the NetBSD Package System"
.Re
.Sh AUTHORS
The pkgcvsupdate utility was written by
.An Stoned Elipot Aq seb@netbsd.org .
