pikpik/minix-pkgsrc/devel/cpuflags/files/cpuflags.1
.\"	$NetBSD: cpuflags.1,v 1.2 2001/06/07 11:56:46 abs Exp $

.Dd May 31, 2001
.Dt CPUFLAGS 1
.Os 
.Sh NAME
.Nm cpuflags
.Nd determine compiler flags to best target current cpu
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
queries the current cpu type and gcc version, then outputs appropriate
compiler options to best target code for that cpu. If no options exist
to target the current cpu then nothing is output.
.Pp
In the event of the cpu not being recognised, a warning is sent to stderr.
.Pp
.Sh ENVIRONMENT
The makefile fragment
.Pa /usr/pkg/share/mk/cpuflags.mk
will set the following
.Xr make 1
variables. The first two are explicitly added to MAKE_ENV.
.Bl -tag -width CPU_FLAGS -compact
.It
.It CPU_FLAGS
The output of cpuflags
.It CPU_DIR
CPU_FLAGS with spaces stripped (eg: for use in PACKAGES)
.It CFLAGS
Has CPU_FLAGS appended
.It CXXFLAGS
Has CPU_FLAGS appended
.El
.Sh FILES
.Bl -tag -width /usr/pkg/share/mk/cpuflags.mk -compact
.It /usr/pkg/share/mk/cpuflags.mk
for inclusion by /etc/mk.conf
.El
.Sh EXAMPLES
.Nm
can be used to set default flags for building entries from pkgsrc
and recompiling the NetBSD kernel or userland by adding the
following to /etc/mk.conf.
.Bd -literal -offset indent
 .sinclude "/usr/pkg/share/mk/cpuflags.mk"
.Ed
.Sh BUGS
.Nm
does not know about many cpu types yet - updates welcomed to <abs@netbsd.org>,
and does not affect packages using imake.
.Pp
Currently
.Nm
is also gcc specific.
