pikpik/minix-pkgsrc/devel/cpuflags/files/cpuflags.1
.\"	$NetBSD: cpuflags.1,v 1.8 2002/07/16 10:42:45 abs Exp $
.Dd May 31, 2001
.Dt CPUFLAGS 1
.Os
.Sh NAME
.Nm cpuflags
.Nd determine compiler flags to best target current cpu
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
queries the current cpu type and gcc version, then outputs appropriate
compiler options to best target code for that cpu. If no options exist
to target the current cpu then nothing is output.
.Pp
In the event of the cpu not being recognised, a warning is sent to stderr.
.Sh ENVIRONMENT
The makefile fragment
.Pa /usr/pkg/share/mk/cpuflags.mk
will set the following
.Xr make 1
variables, plus add CPU_FLAGS and CPU_DIR to .MAKEFLAGS for sub-makes.
.Bl -tag -width CPU_FLAGS -compact
.It
.It CPU_FLAGS
The output of cpuflags
.It CPU_DIR
CPU_FLAGS with spaces stripped (eg: for use in PACKAGES)
.It CFLAGS
Has CPU_FLAGS appended
.It CXXFLAGS
Has CPU_FLAGS appended
.El
.Sh FILES
.Bl -tag -width /usr/pkg/share/mk/cpuflags.mk -compact
.It /usr/pkg/share/mk/cpuflags.mk
for inclusion by /etc/mk.conf
.El
.Sh EXAMPLES
.Nm
can be used to set default flags for building entries from pkgsrc
and recompiling the
.Nx
kernel or userland by adding the following to /etc/mk.conf.
.Bd -literal -offset indent
 .sinclude "/usr/pkg/share/mk/cpuflags.mk"
.Ed
.Pp
On all except low memory machines compliation can be speeded up by adding the
following to /etc/mk.conf. (Note this will not affect the binaries produced)
.Bd -literal -offset indent
COPTS+=-pipe
CFLAGS+=-pipe
.Ed
.Sh BUGS
.Nm
still needs to learn about more cpu types - updates welcomed
to <abs@netbsd.org>.
.Pp
Currently
.Nm
is also gcc specific.
