pikpik/minix-pkgsrc/pkgtools/pkg_tarup/files/pkg_tarup.1
.\" $NetBSD: pkg_tarup.1,v 1.4 2008/11/19 00:20:48 obache Exp $
.Dd March 19, 2011
.Dt PKG_TARUP 1
.Os
.Sh NAME
.Nm pkg_tarup
.Nd utility for tarring up installed software packages
.Sh SYNOPSIS
.Nm
.Op Fl a
.Op Fl d Ar pkgrepository
.Op Fl f Ar filebase
.Op Fl K Ar pkg_dbdir
.Op Fl s Ar pkg_sufx
.Ar pkg-name-or-pattern
.Op Ar ...
.Sh DESCRIPTION
The
.Nm
command is used to create a binary package from an installed package.
It can be used to tar up one or more packages, including dependent
packages, if desired.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl a
Create packages for all dependent packages too.
.It Fl d Ar pkgrepository
Set
.Ar pkgrepository
as the destination directory for the created package file(s).
If this option isn't specified, then
.Pa /tmp
is used.
.It Fl K Ar pkg_dbdir
Set
.Ar pkg_dbdir
as the package database directory.
If this option isn't specified, then the package database directory
is taken from the value of the environment variable
.Ev PKG_DBDIR
if it is set, otherwise it defaults to
.Pa @PKG_DBDIR@ .
.It Fl s Ar pkg_sufx
Set
.Ar pkg_sufx
as the extension used for the created package file(s).
If this option isn't specified, then
.Pa .tgz
.It Fl f Ar filebase
By default filename for created package looks like this
.Dl ${pkgbase}-${pkgversion}${pkg_sufx}
This option allows to
use
.Ar filebase
instead of
.Pa ${pkgbase} .
.El
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm :
.Bl -tag -width indent
.It Ev PREFIX
Package binaries installation prefix used to build the path.
Defaults to
.Pa @PREFIX@ .
.It Ev ECHO , ID , SED , SU_CMD , GREP
Actual commands to use.
These default to
.Pa @ECHO@ ,
.Pa @ID@ ,
.Pa @SED@ ,
.Pa @SU_CMD@ ,
and
.Pa @GREP@ .
.It Ev PKG_DBDIR
If the
.Fl K
flag isn't given, then
.Ev PKG_DBDIR
is the location of the package database directory.
The default package database directory is
.Pa @PKG_DBDIR@ .
.It Ev PKG_SUFX
If the
.Fl s
flag isn't given, then
.Ev PKG_SUFX
is the suffix of the created package file.
The default is
.Pa @PKG_SUFX@ .
.It Ev PKGREPOSITORY
If the
.Fl d
flag isn't given, then
.Ev PKGREPOSITORY
is the destination directory for the created package file(s).
The default is
.Pa /tmp .
.El
.Pp
Any variable that affects
.Xr pkg_info 1
or
.Xr pkg_create 1 .
.Sh EXIT STATUS
The
.Nm
utility exits 0 on success and 1 on errors.
.Sh SEE ALSO
.Xr pkg_create 1 ,
.Xr pkg_info 1 ,
.Xr pkgsrc 7
.Sh BUGS
Packages that contain files with spaces in their names probably
won't work.
There is no way to safely tell
.Xr pkg_create 1
about these files.
