pikpik/minix-pkgsrc/pkgtools/revbump/files/finddepends.1
.\"	$NetBSD$
.\"
.\" Copyright (c) 2006 The NetBSD Foundation, Inc.
.\"
.\" This code was originally contributed to the NetBSD Foundation, Inc.
.\" by Thomas Klausner <wiz@NetBSD.org>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of author nor the names of its contributors may
.\"    be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
.\" IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
.\" IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 6, 2006
.Dt FINDDEPENDS 1
.Os
.Sh NAME
.Nm finddepends
.Nd tool for finding packages including a particular file
.Sh SYNOPSIS
.Nm
.Ar pattern
.Sh DESCRIPTION
.Nm
is a perl script for pkgsrc developers that helps finding packages
affected by a recursive PKGREVISION bump.
Given a
.Ar pattern
on the command line, it will recursively find all buildlink3.mk files
that include it, and then find all Makefiles that include any of the
buildlink3.mk files.
.Pp
See
.Xr revbump 1
for an example of a complete recursive PKGREVISION bump.
.Sh ENVIRONMENT
.Ev PKGSRCDIR
pkgsrc root directory.
Defaults to
.Pa /usr/pkgsrc .
.Sh EXAMPLES
.Dl finddepends security/libtasn1
.Pp
would first output all buildlink3.mk files that include
security/libtasn1, and then all Makefiles that include any of the
found buildlink3.mk files.
.Sh SEE ALSO
.Xr blbump 1 ,
.Xr revbump 1
