pikpik/minix-pkgsrc/pkgtools/revbump/files/revbump.1
.\"	$NetBSD: revbump.1,v 1.1.1.1 2005/01/05 00:31:38 wiz Exp $
.\"
.\" Copyright (c) 2003, 2004, 2005, 2006 The NetBSD Foundation, Inc.
.\"
.\" This code was originally contributed to the NetBSD Foundation, Inc.
.\" by Julio Merino <jmmv@NetBSD.org> and Thomas Klausner <wiz@NetBSD.org>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of author nor the names of its contributors may
.\"    be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
.\" IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
.\" IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 6, 2006
.Dt REVBUMP 1
.Os
.Sh NAME
.Nm revbump
.Nd tool to help bump PKGREVISIONs automatically
.Sh SYNOPSIS
.Nm
.Op Fl p Ar pkgsrcdir
.Op cat1/pkg1 ... catN/pkgN
.Sh DESCRIPTION
.Nm
is a perl script for pkgsrc developers that simplifies bumping
PKGREVISIONs automatically.
Given a package (in
.Ar category/package
format) on the command line or stdin, it will try to increase
the PKGREVISION for that package automatically.
If
.Fl p
is given,
.Ar pkgsrcdir
is used instead of the default
.Pa /usr/pkgsrc .
.Nm
reports successful updates on stdout, and prints the package name
(in
.Ar category/package
form) on stdout for each package where it failed.
.Sh EXAMPLES
.Dl revbump devel/gmake x11/glib2
.Pp
would bump the PKGREVISIONs of gmake and glib2, as would
.Bd -literal -offset indent
revbump \*[Lt]\*[Lt] EOF
devel/gmake
x11/glib2
EOF
.Ed
.Pp
The complete procedure for a recursive dependency bump for
the openssl package using
.Nm
and
.Xr blbump 1
would be:
.Bd -literal -offset indent
cd /usr/pkgsrc
finddepends security/openssl \*[Gt] allbump
grep buildlink3.mk allbump \*[Gt] | sed "s/.buildlink3.mk//" | bl3bump
grep -v buildlink3.mk allbump \*[Gt] | sed "s/.Makefile$//" | makebump
blbump \*[Lt] bl3bump \*[Gt] bl3bump.manual
[handle the *RECOMMENDED* bumps in bl3bump.manual manually]
revbump \*[Lt] makebump \*[Gt] makebump.manual
[handle the PKGREVISION bumps in makebump.manual manually;
 this will include any Makefile.common files - the files that include
 them will currently need to be found manually]
cvs diff `cat allbump`
[look for PYPKGPREFIX -\*[Gt] py22 or py23pth expansions
 in buildlink files and any unrelated diffs you have in your
 local tree, and fix them]
lintpkgsrc -d
[fix broken dependencies noted by this (usually meta-pkg/kde3,
  subversion, nessus)]
cvs diff `cat allbump`
cvs commit `cat allbump`
rm allbump bl3bump* makebump*
.Ed
.Sh SEE ALSO
.Xr blbump 1 ,
.Xr finddepends 1
