pikpik/minix-pkgsrc/pkgtools/pkgfind/files/pkgfind.1
.\" $NetBSD: pkgfind.1,v 1.7 2005/05/08 15:26:36 peter Exp $
.\"
.\" Copyright (c) 2004 Peter Postma <peter@pointless.nl>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 8, 2005
.Dt PKGFIND 1
.Sh NAME
.Nm pkgfind
.Nd find packages in pkgsrc
.Sh SYNOPSIS
.Nm
.Op Fl CcMqx
.Op Fl n Ar number
.Ar keyword
.Op Ar ...
.Sh DESCRIPTION
.Nm
can find packages in pkgsrc.
It tries to find packages which match the
.Ar keyword
in the package name.
.Pp
.Nm
searches in
.Pa /usr/pkgsrc
by default.
You may specify a different path by setting
the environment variable
.Pa PKGSRCDIR .
.Pp
The following options may be used:
.Bl -tag -width Ds
.It Fl C
Search in the
.Dq COMMENT
field, instead of looking at package names.
.It Fl c
Do case sensitive searches.
.It Fl M
Search in the
.Dq MAINTAINER
field, instead of looking at package names.
.It Fl n Ar number
Stop searching after
.Ar number
packages are found.
.It Fl q
Don't show the comment in the output, only the package name.
.It Fl x
Do exact word searches.
.El
.Sh SEE ALSO
.Pa http://www.pkgsrc.org/
.Sh AUTHORS
.An Peter Postma Aq peter@pointless.nl
