pikpik/minix-pkgsrc/pkgtools/port2pkg/files/port2pkg.1
.\"	$NetBSD: port2pkg.1,v 1.4 2004/01/10 21:19:59 wiz Exp $
.\"
.\" Copyright (c) 1999 by Kazuki Sakamoto (sakamoto@netbsd.org)
.\" Absolutely no warranty.
.\"
.Dd January 10, 2004
.Dt PORT2PKG 1
.Sh NAME
.Nm port2pkg
.Nd convert a FreeBSD port to a NetBSD package
.Sh SYNOPSIS
.Nm
.Op Fl m Ar maintainer
.Ar portsdir
.Ar pkgsrcdir
.Sh DESCRIPTION
.Nm
tries to convert a
.Fx
port to a
.Nx
package.
.Nm
copies files
from
.Ar portsdir
to
.Ar pkgsrcdir
(if
.Ar pkgsrcdir
doesn't exists, it is created first),
and tries adapting the Makefile, patches and some other files
to
.Nx
pkgsrc.
.Ss Options
.Bl -tag -width Fl
.It Fl m
Adjust maintainer of this package
(default: tech-pkg@NetBSD.org).
.El
.Sh EXAMPLES
.Dl port2pkg /mnt/ports/<category>/foo /usr/pkgsrc/<category>/foo
or
.Dl port2pkg -m your@email /mnt/ports/<category>/foo /usr/pkgsrc/<category>/foo
.Sh SEE ALSO
Read
.Ar Package Constructor's Guide
in
.Pa pkgsrc/doc/pkgsrc.txt .
.Sh AUTHORS
.An Kazuki Sakamoto Aq sakamoto@netbsd.org
.Sh BUGS
.Nm
is not a magic wand, please double-check converted pkgsrc.
